# シート名一覧: 全機諸元 フライトプラン 重量分布 荷重評価 主翼 水平尾翼 垂直尾翼 カウル 胴接構造 主桁 積層構成 翼型


# ------------------------ 全機諸元 ------------------------ ##
# ---------------------- フライトプラン---------------------- ##
# ------------------------ 重量分布 ------------------------ ##
# ------------------------ 荷重評価 ------------------------ ##
# -------------------------- 主翼 ------------------------- ##
# ------------------------ 水平尾翼 ------------------------ ##
# ------------------------ 垂直尾翼 ------------------------ ##
# ------------------------- カウル ------------------------- ##
# ------------------------ 胴接構造 ------------------------ ##
# -------------------------- 主桁 -------------------------- ##
# ------------------------ 積層構成 ------------------------ ##
laminate_cell = "B4:L21"
# -------------------------- 翼型 -------------------------- ##
# 読み込み先
alpha_min_cell = "C3"
alpha_max_cell = "D3"
alpha_step_cell = "E3"
Re_min_cell = "C4"
Re_max_cell = "D4"
Re_step_cell = "E4"
foil_name_cell_start = "B13"
ref_Re_cell_start = "I13"
ref_alpha_cell_start = "M13"

# 出力先
thickness_cell_start = "C13"
thickness_at_cell_start = "D13"
camber_cell_start = "E13"
camber_at_cell_start = "F13"
leading_edge_radius_cell_start = "G13"
trailing_edge_angle_cell_start = "H13"
CL_max_cell_start = "J13"
L_D_max_cell_start = "K13"
L_D_max_at_cell_start = "L13"
CL_cell_start = "N13"
L_D_cell_start = "O13"
Cm_cell_start = "P13"
XCp_cell_start = "Q13"
Xtr_top_cell_start = "R13"
outline_cell_start = "S13"

# -------------------------- 物性値 -------------------------- ##
prepreg_cell = "B54:X57"
